{
    "general": {   
        "guild" : "704383751224033301", 
    
        "commands_path": "./commands",
        "events_path": "./events",
        "books_path" : "./books",
    
        "main_link": "https://discord.gg/ZzWcjQezWg",
        
        "leader": "704384928451919884",
        "admin": "704385440391626782",
        "support": "883975383370850364",
        "junior": "704691487857704980"
    },

    "fun": {
        "statuses": [
            "Та я тут побуду", 
            "Кава гаряча москалі холодні", 
            "Відро з гайками", 
            "Пари не удари, можна пропустити", 
            "П'ю пиво", 
            "Зустрілись якось два стоматолога...", 
            "Депресивний робот", 
            "Озирайся покидьку!", 
            "Срав пес перділи гуси", 
            "Євпатій коловрат", 
            "Кислий борщ мені в стаканчик", 
            "Ямете кудасааай", 
            "Ніхуя собі блять", 
            "Sum optimus, sed hoc mihi ignosce", 
            "Я ЖИ-ВИИИИИЙ", 
            "Назар, дай відро", 
            "Я в Маямі а ти в ямі",
            "Carthago delenda est",
            "Яша Лава",
            "Fuck you letherman!",
            "Зара тебе скручу троха",
            "Ти хлопчик чи дівчинка?",
            "Їбались миші в шахматному порядку",
            "Пес Патрон!",
            "Саша ну шо ти? Налий, шоб мені соромно не було!",
            "Насеру твоїй матері!",
            "Якщо гора не йде до Могамеда, то вона йде в дупу",
            "Хороший асфальт на дорозі не валяється",
            "Підпизь здесь і підпизь здесь!",
            "Ці руки нічого не крали!",
            "Це ж було вже!",
            "Територію нашої країни треба зробити небезпечною",
            "Бєгатель па пеньочкам",
            "А це скільки в шапках?",
            "Маємо те що маємо"
            ],
        "divinations": ["Якщо кількість не може перейти в якість, безсумнівно, треба випити ще.", "Чекай не ридай, прийде до тебе сюрприз.", "Вийшовши вранці з квартири подивись направо, побачиш машину, скоро у тебе з’явиться така.", "Відкрий саму нудну книгу на 55 сторінці там буде відповідь на хвилююче питання.", "Згадаєш ім’я першої вчительки, чекає тебе щастя.", "Глянеш ліворуч — зустрінеш свою любов.", "Сьогоднішній день найкращий, як всі інші.", "Переходячи дорогу уважно дивіться по сторонам, ваша доля десь поруч.", "В цьому році позбудешся від однієї шкідливої звички, а придбаєш відразу дві.", "У наступну суботу чекає тебе робота.", "Новий друг раптом з’явиться.", "Нові знання принесуть Вам успіх.", "Вам належить розглянути несподівану пропозицію.", "Робіть те, чого просить душа і тіло.", "Докладайте максимум зусиль і отримаєте бажане.", "Щоб зрозуміти, що заважає Вашому розвитку, загляньте всередину себе.", "Прийшов час закінчити старе і почати нове.", "Робіть то, що Ви вважаєте правильним для Вас.", "Будьте уважні до підказок долі.", "Хтось буде дуже сильно хвилювати Ваші почуття і емоції.", "Робіть те, чого просить душа і тіло.", "Всесвіт чує і розуміє тебе. Не квап події.", "Хочеш знайти новий шлях – прямо зараз зійди зі старого.", "Зроби щось важливе прямо зараз.", "Якщо відчуваєш, що це твоє – нікого не слухай, ризикни!", "Настав час, щоб просто розслабитися і відпочити.", "Будуть у вас торти, солодощі та інші дрібні радості.", "Ваші надії і плани перевершать усі сподівання.", "Прийміть те, що не можете змінити, і відчуєте себе краще.", "Удача допоможе вам пережити всі важкі часи.", "Хороші новини прийдуть вам поштою.", "Доля озолотить вам ручку – пошле величезну зарплату.", "Ви в вершки суспільства ввійдете, можливо, спонсора знайдете.", "У тебе прекрасний стиль, гарного дня, золотко.", "Удачу злови за хвіст – чекає на тебе кар’єрний ріст.", "Вміння чути інших – це добре, а вміння слухати їх ще краще!",
    "Всесвіт чує і розуміє тебе. Не квап події.",
    
    "Робіть те, чого просить душа й тіло.",
    
    "Настав час, щоб просто розслабитись і відпустити.",
    
    "Чудовий день, щоб прочитати новий тайтл від Мроко.",
    
    "Сьогодні вийде новий розділ твоєї улюбленої манґи. Але це не точно…",
    
    "Такій прекрасній людині як ти, сьогодні усміхнеться доля.",
    
    "Не варто покладиться на долю, добре подумай ще раз.",
    
    "В особистому житті можливі несподівані повороти, які зможуть змінити хід подій. ",
    
    "Цей тиждень буде сповнений моментів невизначеності.",
    
    "Сьогодні ви пожинаєте те, що посіяли!",
    
    "У цей момент складаються сприятливі обставини, тому робіть найскладніші кроки.",
    
    "На вас очікує захоплива подорож, проте не виходьте за рамки бюджету.",
    
    "На цьому тижні зірки обіцяють  зустріч із людиною, яка зіграє важливу роль у вашому розвитку.",
    
    "Не варто кидати розпочате, навіть якщо щось іде зовсім не так, як хотілось б.",
    
    "Можливі грошові надходження, зокрема з несподіваних джерел. ",
    
    "Цього тижня у вас залишиться багато вільного часу після роботи, який ви зможете використати для реалізації будь-якого хобі, яким давно хотіли б займатися. ",
    
    "Є ймовірність, що ви не зможете виконувати свою роботу якийсь час.",
    
    "Цього тижня, завдяки гарному здоров'ю, ваша впевненість у собі підвищиться.",
    
    "Будьте обережні на дорозі.",
    
    "Незважаючи на напружений графік цього тижня, ваше самопочуття буде кращим, ніж зазвичай. ",
    
    "У цей день вам варто прислухатися до своєї інтуїції. Вона не підведе вас навіть у найскладніших ситуаціях.",
    
    "Ви зможете проявити всі свої таланти. Оточуючі оцінять це і перейдуть на ваш бік.",
    
    "Сьогодні ви можете поговорити зі своїм керівництвом про підвищення зарплати. Начальство буде до вас прихильно.",
    
    "Всі починання принесуть вам успіх і задоволення від виконаної роботи. Ви будете купатися в променях слави.",
    
    "У вас можуть з'явитися нові джерела доходу. Подумайте над тим, що у вас найкраще виходить.",
    
    "У цей день вам потрібно тримати язика за зубами й не ділитися з оточуючими своїми планами. Є ризик, що плани можуть зірв,атися.",

    "День буде сприятливим для ділових зустрічей. Ви можете отримати підтримку впливових людей.",

    "Сьогодні ви можете реалізувати свої найсміливіші бажання. День буде наповнений позитивними емоціями.",

    "Вам потрібно пропрацювати помилки, витягти досвід зі старих неприємностей і сміливо рухатися вперед.",

    "Вам варто присвятити цей день спорту. Активних фізичних навантажень можна уникнути, а ось йога буде те, що й треба. Або хоча б вийдіть на вулицю…",

    "Сьогодні ви можете розчаруватися в людях, яких вважали своїми друзями.",

    "Не варто сліпо довіряти першому зустрічному.",

    "Хто не ризикує - той не п'є шампанське. Пам'ятайте про це і сміливо рухайтеся назустріч своїй мрії.",

    "У цей день вам просто заборонено сумніватися. Сміливо приймайте важливі рішення, не бійтеся помилитися. Зробіть останній стрибок до своїх цілей.",

    "Ви зможете проявити всі свої таланти. Оточуючі заздритимуть вам, але пам'ятайте, що якщо вам заздрять, то ви попереду. (якщо вам плюнули в спину, то ви теж попереду, ю ноу)",

    "Не варто навантажувати себе роботою, інакше можливий нервовий зрив.",

    "У цей день ви можете купити все, що дуже давно хотіли. Всі покупки принесуть вам радість.",

    "Сьогодні вам не можна зловживати алкоголем та їсти жирну їжу, інакше може бути отруєння.",

    "Проявіть свою галантність і стриманість в спілкуванні, якщо хочете переманити на свій бік впливових людей.",

    "Завдяки вашому позитивному настрою, ви зможете відчинити перед собою будь-які двері. Доля буде прихильною до вас.",

    "Ви можете стати центром уваги. Оточуючі то й будуть робити, що оцінювати вас.",

    "З самого ранку вам може здаватися, що пані Фортуна відвернулася від вас. Але вже вдень ви зрозумієте, що це не так. Вечір буде дуже продуктивним.",

    "У цей день рекомендуємо відмовитися від екстравагантних вчинків і робити так, як вам велить ваше серце (це як? думайте самі, передбачення зламалося).",

    "Сьогодні ви зможете проявити всі свої таланти і відкрити перед собою нові перспективи.",

    "Усі проблеми, які у вас були в особистому житті, відійдуть на другий план. На першому місці буде робота і вирішення професійних завдань."

]
    }
}
