const { SlashCommandBuilder, PermissionFlagsBits } = require("discord.js");

module.exports = {
    data: new SlashCommandBuilder()
        .setName('test')
        .setDescription('Тестова команда. Доступно тільки адміністраторам')
        .setDefaultMemberPermissions(PermissionFlagsBits.Administrator),
    async execute(client, interaction) {
        const message = await interaction.channel.messages.fetch('1128803880201879642')


        await message.edit({embeds: [{
            title: 'Правила',
            color: 0x004B4B,
            fields: [{
                name: 'ㅤ\t**-=КОНТЕНТ=-**',
                value: `\`1)\` Заборонено контент 18+ відео, зображення, сексуального характеру  та різний треш по типу трупів людей, тварин суїциду. 
                *Покарання: перманентний бан.*
                            
                \`2)\` Заборонений флуд та спам у любому вигляді включаючи ґіфки картинки і так далі. 
                *Покарання: мут на 30 хв.*
                            
                \`3)\` Заборонено розповсюдження конфіденційної та чутливої інформації інших людей, без їх дозволу. 
                *Покарання: попередження в другий раз мут на 1 день на третій раз перманентний бан.*
                            
                \`4)\` Заборонено поширювати потенційно шкідливий та просто шкідливий чи небезпечні програми (віруси) та чіти для ігор і підозрілі файли. 
                *Покарання: перманетний бан.*`},{name:'',value:`
\`5)\` Заборонені непристойні чи провокативні ніки та опис в профілі (гітлер, сталін і т.д.). 
*Покарання: перший раз попередження, другий мут, якщо  людина не хоче міняти нік та опис бан.*

\`6)\` На цьому сервері є тематичні текстові канали. Потрібно відправляти повідомлення у відповідні канали в залежності від вмісту повідомлення.
                А також обов'язково створювати гілки якщо відповідей на повідомлення буде більше ніж чотири. Назва і опис кожного текстового каналу однозначно вказує, для якого вмісту він створений.
                *При порушенні і відхилення прохання видалити нерелевантне повідомлення попередження якщо людина не перестала мут на 30 хв.*

                \`7)\` У нас присутній текстовий канал <#1185202857989914705>  у якому ви зможете запитати або запропонувати свою ідею, поставити питання на рахунок сервера. Заборонені заявки з неадекватним змістом. 
                *Покарання: мут від 30 хв до 1 дня.*
                
                
                ㅤ`
            },{
                name: 'ㅤ\t**-=ТОКСИЧНІСТЬ=-**',
                value: `\`1)\` Не принижуйте особисту честь і гідність інших учасників без вагомої причини і без належного обґрунтування.
                *Якщо ви не повелися на провокацію провокатор отримує мут від 30 хв до 1 дня в залежності від самої провокації. При особливо злісному порушенні карається баном.*
                            
                \`2)\` Заборонено дискримінувати кого-небудь на основі будь-якої різниці особистостей (раса, стать і так далі.) (окрім росіян. Їх треба булити). 


                ㅤ`
            },{
                name: 'ㅤ\t**-=НЕАДЕКВАТНА ПОВЕДІНКА=-**',
                value: `\`1)\` Поведінка в текстових каналах. Заборронені загострені обговорення та агресивні висловлювання без будь якої адекватної аргументованої причини.
                *Приклад: Ти деган тому, що просто або ти дебіл тому, що я так хочу.
                Покарання: попередження якщо учасник не зупиняється і далі поводитися не адекватно мут від 5хв. до 3 днів.*
                
                \`2)\` Поведінка в голосових каналах.
                Заборонені вигукування без підстав, включення музики з телефону якщо тебе не просили , неадекватна поведінка на вебкамері, або інші негативні вчинки які можуть негативно вплинути  на інших учасників в голосовому каналі
                *Покарання: попередження якщо учасник не слухається та не зупиняється видається мут від 5 хв. до 3 дінв.*`},
                {name:'',value:`
                **Увага! Якщо вам не подобаються поведінка учасника сервера напишіть скаргу в текстовий канал <#1185202857989914705> і якщо на цього учасника буде більше ніж 9 адекватно аргументованих скарг адміністрація сервера розбереться з ним.
                Якщо учасник після попередження продовжує поводити себе неадекватно йому видається мут від 30хв. до 3 днів в залежності від того що він сказав.**


                ㅤ`
            },{
                name: 'ㅤ\t**-=ПОЛІТИКА=-**',
                value: `\`1)\` Заборонена підтримка РФ. 
                *Покарання: перманентний бан *
                            
                \`2)\` Не визнання агресії РФ у бік України та окупація українських земель.
                *Покарання: перманентний бан.*
                            
                \`3)\` Поширення злісних російських пропагандистських тезисів. 
                *Покарання: попередження, бан.*
                
                **Спілкування та друкування російською призведе до зниження поваги до особи яка це робить.**


                ㅤ`
            },{
                name: 'ㅤ\t**-=РЕКЛАМА=-**',
                value: `\`1)\` Заборонено розповсюджувати рекламу без дозволу <@&704385440391626782>, <@&704384928451919884>. Рекламою вважається посилання на інші спільноти будь яких соціальних мереж, блогів, діскорд серверів телеграмі ітд.
                *Покарання: перманетний бан який автоматично видається ботом зразу після того як скинете рекламу.*
                            
                \`2)\` Винятком є YouTube канали, пов'язані із популяризацією культури, історії, політичного контенту чи науки українською. Такі канали можна поширювати в каналі <#704388054928064652>
                <#704387452453781524>     
                **Якщо ви бажаєте запропонувати рекламу - використайте заявку і через певний період часу адміністрація сервера тобто: <@&704384928451919884> <@&704385440391626782> <@&883975383370850364> звяжиться з вами і оговорить усі моменти.
                
                Ми ні в якому разі не співпрацюємо з русньою і ніколи не будемо! **`
            }]
        }]})
    }

}